# Тренировка работы с кортежами.
# Задание - необходимо использовать срезы и вывести все кроме последних трех


countries = ('Russia', 'Argentina', 'Slovakia', 'Canada', 'Slovenia', 'Italy', 'Spain', 'Ukraine', 'Chile', 'Cameroon')
print(countries[:-3])