# Тренировка работы с кортежами.
# Задание - необходимо дополнить код и сделать чтобы переменная содержала количество элементов кортежа

countries = ('Romania', 'Poland', 'Estonia', 'Bulgaria', 'Slovakia', 'Slovenia', 'Hungary')
number = len(countries)
print(number)