# Тренировка работы с кортежами.
# Задание - необходимо использовать срезы и вывести все кроме двух последних и трех первых

countries = ('Russia', 'Argentina', 'Slovakia', 'Canada', 'Slovenia', 'Italy', 'Spain', 'Ukraine', 'Chile', 'Cameroon')
print(countries[3:-2])