# Напишите программу, которая переопределяет встроенную функцию print() так,
# чтобы она печатала все переданные строковые аргументы в верхнем регистре.
#
# Примечание 1. Значения sep и end также должны переводиться в верхний регистр.
#
# Примечание 2. В тестирующую систему сдайте программу, содержащую только
# переопределенную функцию print(), но не код, вызывающий ее.
#
# Задача представлена исключительно в учебных целях,
# на практике применять подобное, конечно, не следует.



def new_print():
    pass





















