# Вложенные словари и генераторы
# Необходимо дополнить код, что бы получить словарь состоящий
# из словаря letters за исключением ключей из списка remove_keys
# желательно написать генератор


letters = {0: 'A', 1: 'B', 2: 'C', 3: 'D', 4: 'E', 5: 'F', 6: 'G', 7: 'H', 8: 'I', 9: 'J', 10: 'K', 11: 'L', 12: 'M', 13: 'N', 14: 'O', 15: 'P', 16: 'Q', 17: 'R', 18: 'S', 19: 'T', 20: 'U', 21: 'V', 22: 'W', 23: 'X', 24: 'Y', 26: 'Z'}

remove_keys = [1, 5, 7, 12, 17, 19, 21, 24]

result = {k: letters[k] for k in letters if k not in remove_keys}

print(result)