# Основы работы со словарями
# необходимо написать код, который преобразует фразу в код азбуки морзе

letters = [c for c in 'ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789']
morse = ['.-', '-...', '-.-.', '-..', '.', '..-.', '--.', '....', '..', '.---', '-.-', '.-..',
         '--', '-.', '---', '.--.', '--.-', '.-.', '...', '-', '..-', '...-', '.--', '-..-',
         '-.--', '--..', '-----', '.----', '..---', '...--', '....-', '.....', '-....', '--...',
         '---..', '----.']

morse_dict = dict(zip(letters, morse))

frase = input()

for let in frase.upper():
    if let in morse_dict:
        print(morse_dict[let], end=' ')


