# Даны два комплексных числа.
# Напишите программу, которая вычисляет и выводит их сумму, разность и произведение.


z_1, z_2 = complex(input()), complex(input())

for i in '+-*':
    print(f'{z_1} {i} {z_2} = {eval(f"z_1 {i} z_2")}')


(1+2j) + (-2+4j) =  (-1+6j)
(1+2j) - (-2+4j) =  (3-2j)
(1+2j) * (-2+4j) =  (-10+0j)