# Тренировка матриц.
# Задание необходимо вывести шахматную доску, получить значение на котором стоит фигура
# обозначить буквой N место расположение фигуры. и обозначить варинаты хода фигуры конем

horizontal = 'abcdefgh'
vertical = '87654321'
chest_n = 8

fi = input()
y, x = horizontal.index(fi[0]), vertical.index(fi[1])

chest_matr = [['.'] * chest_n for _ in range(chest_n)]


for r in range(chest_n):
    for c in range(chest_n):
        if r == x and c == y:
            chest_matr[r][c] = 'N'
        if (x - r)**2 + (y - c)**2 == 5:
            chest_matr[r][c] = '*'
        print(chest_matr[r][c], end=' ')

    print()


# b6
# На выходе
#
# * . * . . . . .
# . . . * . . . .
# . N . . . . . .
# . . . * . . . .
# * . * . . . . .
# . . . . . . . .
# . . . . . . . .
# . . . . . . . .


#Визуализация закономерностей индексов
# 0,0  0,1  0,2  0,3  0,4  0,5  0,6  0,7
# 1,0  1,1  1,2  1,3  1,4  1,5  1,6  2,7
# 2,0  2,1  2,2  2,3  2,4  2,5  2,6  2,7
# 3,0  3,1  3,2  3,3  3,4  3,5  3,6  3,7
# 4,0  4,1  4,2  4,3  4,4  4,5  4,6  4,7
# 5,0  5,1  5,2  5,3  5,4  5,5  5,6  5,7
# 6,0  6,1  6,2  6,3  6,4  6,5  6,6  6,7
# 7,0  7,1  7,2  7,3  7,4  7,5  7,6  7,7
