# Дан список numbers, содержащий кортежи чисел. Напишите программу,
# которая сортирует и выводит список numbers в соответствии с суммой
# минимального и максимального элемента кортежа.


# Элементы списка numbers - кортежи со значениями - поэтому возможно написать функцию
# в которой вычисляется сумма мин и макс значений и уже по этому условию сортируются элементы
def compare_elements(num):
    return sum((min(num), max(num)))


numbers = [(10, 10, 10), (30, 45, 56), (81, 80, 39), (1, 2, 3), (12, 45, 67), (-2, -4, 100), (1, 2, 99), (89, 90, 34), (10, 20, 30), (50, 40, 50), (34, 78, 65), (-5, 90, -1)]

print(sorted(numbers, key=compare_elements))